Revit 2027 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForDiameter Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LiningThicknessIsLargeForDiameter { get; }
Public Shared ReadOnly Property LiningThicknessIsLargeForDiameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForDiameter {
	FailureDefinitionId^ get ();
}
static member LiningThicknessIsLargeForDiameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace